БПКР/src/DataProcessors/ПечатьЭтикетокИЦенниковБПО/ПечатьЭтикетокИЦенниковБПО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьЭтикетокИЦенниковБПО</name>
  <attributes>
    <name>ТорговыйОбъектБПО</name>
    <type>
      <types>DefinedType.ТорговыйОбъектБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьНаОбычномПринтере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>DefinedType.ВидЦеныБПО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураБПО</name>
      <type>
        <types>DefinedType.НоменклатураБПО</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаБПО</name>
      <type>
        <types>DefinedType.ХарактеристикаБПО</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковкаБПО</name>
      <type>
        <types>DefinedType.УпаковкаБПО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизацияБПО</name>
      <type>
        <types>DefinedType.ОрганизацияБПО</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЦенникаЭтикетки</name>
      <type>
        <types>CatalogRef.ШаблоныЭтикетокИЦенниковБПО</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

БПКР/src/Catalogs/ШаблоныЭтикетокИЦенниковБПО/ШаблоныЭтикетокИЦенниковБПО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныЭтикетокИЦенниковБПО</name>
  <predefined>
    <items>
      <name>ШаблонЦенникАкционный</name>
      <description>Ценник акционный</description>
    </items>
    <items>
      <name>ШаблонЦенникМалый</name>
      <description>Ценник малый</description>
    </items>
    <items>
      <name>ШаблонЭтикеткаБольшой</name>
      <description>Этикетка большая</description>
    </items>
    <items>
      <name>ШаблонЭтикеткаМалый</name>
      <description>Этикетка малая</description>
    </items>
  </predefined>
  <attributes>
    <name>XMLОписаниеМакета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Поля</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Формат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БПКР/src/DataProcessors/ПечатьЭтикетокИЦенниковБПО/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПечатьЭтикетокИЦенниковБПОПереопределяемый.ПриОпределенииПереопределенияПодбораТоваров(ПереопределенаФормаПодбора);
	ПечатьЭтикетокИЦенниковБПОПереопределяемый.ПриОпределенииПереопределенияПодбораПоШтрихкоду(ПереопределенаФормаПоискаПоШтрихкоду);
	
	УстановитьВидимостьИДоступностьЭлементовФормы();
	УстановитьВидимостьЭлементовИКолонокТаблицы();
	
	ПечатьЭтикетокИЦенниковБПОПереопределяемый.ФормаПечатьЭтикетокИЦенниковПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	ЭтотОбъект.ИспользоватьПодключаемоеОборудование = Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода, СчитывательМагнитныхКарт");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	ИсходныеДанные = Данные;
	
	РазделительGS1 = МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1();
	ЭкранированныйСимволGS1 = МенеджерОборудованияМаркировкаКлиентСервер.ЭкранированныйСимволGS1();
	Данные = СтрЗаменить(Данные, РазделительGS1, ЭкранированныйСимволGS1);
	
	ОписаниеСобытия = Новый Структура();
	ОписаниеОшибки  = "";
	ОписаниеСобытия.Вставить("Источник", Источник);
	ОписаниеСобытия.Вставить("Событие",  Событие);
	ОписаниеСобытия.Вставить("Данные",   Данные);
	
	Результат = МенеджерОборудованияКлиент.ПолучитьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
	Если Результат = Неопределено Тогда 
		ТекстСообщения = НСтр("ru = 'При обработке внешнего события от устройства произошла ошибка:'")
		+ Символы.ПС + ОписаниеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	Иначе
		Если Результат.Источник = "ПодключаемоеОборудование" Тогда
			Если Результат.ИмяСобытия = "ScanData" Тогда
				
				ДанныеОповещения = Результат.Параметр;
				ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПоискаПоШтрихкодуЭтикетокИЦенниковБПО", ЭтотОбъект);
				ВыполнитьОбработкуОповещения(ОписаниеОповещения, ДанныеОповещения);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыВыбранПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока = ТекущиеДанные.НомерСтроки - 1;
	
	Если НЕ ТекущиеДанные.Выбран Тогда
		ТекущиеДанные.Выбран = Ложь;
	Иначе
		
		ТекущиеДанные.Выбран = Истина;
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ШаблонЦенникаЭтикетки) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Не выбран шаблон печати'");
			Сообщение.Поле = "Объект.Товары["+ТекущаяСтрока+"].ШаблонЦенникаЭтикетки";
			Сообщение.Сообщить();
			
			ТекущиеДанные.Выбран = Ложь;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(ТекущиеДанные.Количество) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Не задано количество ценников'");
			Сообщение.Поле = "Объект.Товары["+ТекущаяСтрока+"].Количество";
			Сообщение.Сообщить();
			
			ТекущиеДанные.Выбран = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьТовары(Команда)
	ПодобратьТоварыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ТорговыйОбъект", Объект.ТорговыйОбъектБПО);
	ПараметрыПечати.Вставить("Товары", Объект.Товары);
	
	Если Объект.ПечатьНаОбычномПринтере И ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.ШаблоныЭтикетокИЦенниковБПО.ПустаяСсылка"));
		
		МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
		МодульУправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьЭтикетокИЦенниковБПО", "Ценники", ПараметрКоманды, ЭтотОбъект, ПараметрыПечати);
		
	Иначе
		
		ПоляДляЗаполнения = Новый Массив;
		ДанныеДляПринтераЭтикеток = ДанныеДляПринтераЭтикетокНаСервере(ПараметрыПечати, ПоляДляЗаполнения);
		
		Для Каждого Макет Из ДанныеДляПринтераЭтикеток Цикл
			
			ОписаниеОповещениеПриЗавершенииПечати = Новый ОписаниеОповещения("ОбработкаКомандыПечатиЦенниковИЭтикетокНаПринтереЭтикетокЗавершение", ЭтотОбъект);
			ПараметрыПечатиЭтикеток = ОборудованиеПринтерыЭтикетокКлиент.ПараметрыОперацииПечатиЭтикеток(Макет.XMLОписаниеМакета, Макет.ДанныеДляПечатиЭтикеток);
			ОборудованиеПринтерыЭтикетокКлиент.НачатьПечатьЭтикеток(ОписаниеОповещениеПриЗавершенииПечати, ЭтаФорма.УникальныйИдентификатор, Неопределено, ПараметрыПечатиЭтикеток);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьШаблонЦенников(Команда)
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОбработчикУстановкиШаблона", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОткрытьФорму("Справочник.ШаблоныЭтикетокИЦенниковБПО.ФормаВыбора", , ЭтаФорма,,,, ОбработчикОповещения, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличествоЦенников(Команда)
	
	ВыбранноеЗначение = Неопределено;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеУстановитьКоличествоЦенников", ЭтотОбъект);
	ПоказатьВводЧисла(ОписаниеОповещения,ВыбранноеЗначение, НСтр("ru = 'Введите количество ценников/этикеток'"), 10, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	//тест
	Штрихкод = "";
	ТекстЗаголовка = НСтр("ru = 'Введите штрихкод'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПоискаПоШтрихкодуЭтикетокИЦенниковБПО", Объект);
	
	ПоказатьВводСтроки(ОписаниеОповещения, Штрихкод, ТекстЗаголовка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВТСД(Команда)
	
	ДополнительныеПараметры = ПечатьЭтикетокИЦенниковБПОКлиентПереопределяемый.ПараметрыВыгрузкиИЗагрузкиВТСД();
	ПечатьЭтикетокИЦенниковБПОКлиентПереопределяемый.ВыгрузитьВТСД(ЭтотОбъект, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТСД(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеЗагрузкиИзТСДЭтикетокИЦенниковБПО", Объект);
	
	ДополнительныеПараметры = ПечатьЭтикетокИЦенниковБПОКлиентПереопределяемый.ПараметрыВыгрузкиИЗагрузкиВТСД();
	ПечатьЭтикетокИЦенниковБПОКлиентПереопределяемый.ЗагрузитьИзТСД(ЭтотОбъект, ДополнительныеПараметры, ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементовФормы()
	
	Если Не ПереопределенаФормаПодбора Тогда
		
		Элементы.ПодобратьТовары.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Не ПереопределенаФормаПодбора Тогда
		
		Элементы.ПоискПоШтрихкоду.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовИКолонокТаблицы()
	
	Если Не ЗначениеЗаполнено(Метаданные.ОпределяемыеТипы.ХарактеристикаБПО.Тип) Тогда
		Элементы.Товары["ТоварыХарактеристикаБПО"].Видимость = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Метаданные.ОпределяемыеТипы.УпаковкаБПО.Тип) Тогда
		Элементы.Товары["ТоварыУпаковкаБПО"].Видимость = Ложь;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Метаданные.ОпределяемыеТипы.НоменклатураБПО.Тип) Тогда
		Элементы.Товары.Видимость = Ложь;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Метаданные.ОпределяемыеТипы.ТорговыйОбъектБПО.Тип) Тогда
		Элементы.ТорговыйОбъект.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТоварыНаКлиенте()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ФормаВладелец", ЭтотОбъект);
	ПараметрыОткрытия.Вставить("ОбработчикЗакрытия", Новый ОписаниеОповещения("ПодобратьТоварыЗавершение", ЭтотОбъект, Объект.ТорговыйОбъектБПО));
	ПараметрыОткрытия.Вставить("РежимБлокировки", РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ПараметрыОткрытия.Вставить("ТорговыйОбъект", Объект.ТорговыйОбъектБПО);
	
	ПечатьЭтикетокИЦенниковБПОКлиентПереопределяемый.ОткрытьФормуПодбора(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТоварыЗавершение(Результат, ПараметрыОперации) Экспорт
	
	МассивТоваровДляПечати = Новый Массив;
	ПечатьЭтикетокИЦенниковБПОКлиентПереопределяемый.ПодобратьТоварыЗавершение(Результат, ПараметрыОперации, МассивТоваровДляПечати);
	
	Для Каждого Товар Из МассивТоваровДляПечати Цикл
		
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.НоменклатураБПО   = Товар.НоменклатураБПО;
		НоваяСтрока.ХарактеристикаБПО = Товар.ХарактеристикаБПО;
		НоваяСтрока.УпаковкаБПО       = Товар.УпаковкаБПО;
		НоваяСтрока.Цена              = Товар.Цена;
		НоваяСтрока.ОрганизацияБПО    = Товар.ОрганизацияБПО;
		НоваяСтрока.Штрихкод          = Товар.Штрихкод;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПоискаПоШтрихкодуЭтикетокИЦенниковБПО(Штрихкод, ПараметрыОперации) Экспорт
	
	МассивТоваровДляПечати = Новый Массив;
	ПечатьЭтикетокИЦенниковБПОКлиентПереопределяемый.ОповещениеПоискаПоШтрихкодуЭтикетокИЦенниковБПО(Штрихкод, ПараметрыОперации, МассивТоваровДляПечати);
	
	Для Каждого Товар Из МассивТоваровДляПечати Цикл
		
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.НоменклатураБПО   = Товар.НоменклатураБПО;
		НоваяСтрока.ХарактеристикаБПО = Товар.ХарактеристикаБПО;
		НоваяСтрока.УпаковкаБПО       = Товар.УпаковкаБПО;
		НоваяСтрока.Цена              = Товар.Цена;
		НоваяСтрока.ОрганизацияБПО    = Товар.ОрганизацияБПО;
		НоваяСтрока.Штрихкод          = Товар.Штрихкод;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗагрузкиИзТСДЭтикетокИЦенниковБПО(Результат, ПараметрыОперации) Экспорт
	
	МассивТоваровДляПечати = Новый Массив;
	ПечатьЭтикетокИЦенниковБПОКлиентПереопределяемый.ОповещениеЗагрузкиИзТСДЭтикетокИЦенниковБПО(Результат, ПараметрыОперации, МассивТоваровДляПечати);
	
	Для Каждого Товар Из МассивТоваровДляПечати Цикл
		
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.НоменклатураБПО   = Товар.НоменклатураБПО;
		НоваяСтрока.ХарактеристикаБПО = Товар.ХарактеристикаБПО;
		НоваяСтрока.УпаковкаБПО       = Товар.УпаковкаБПО;
		НоваяСтрока.Цена              = Товар.Цена;
		НоваяСтрока.ОрганизацияБПО    = Товар.ОрганизацияБПО;
		НоваяСтрока.Штрихкод          = Товар.Штрихкод;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикУстановкиШаблона(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		Количество = 0;
		МассивСтрок = Элементы.Товары.ВыделенныеСтроки;
		
		Для Каждого НомерСтроки Из МассивСтрок Цикл
			
			СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
			СтрокаТЧ.ШаблонЦенникаЭтикетки = ВыбранноеЗначение;
			СтрокаТЧ.Количество = 1;
			СтрокаТЧ.Выбран = Истина;
			
			Если СтрокаТЧ.Выбран Тогда
				Количество = Количество + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		КоличествоВсего = МассивСтрок.Количество();
		
		Текст = НСтр("ru = 'Установлен шаблон ""%Шаблон%"".'");
		Текст = СтрЗаменить(Текст, "%Шаблон%", ВыбранноеЗначение);
		
		ПоказатьОповещениеПользователюОВозможнойОшибке(Текст, Количество, КоличествоВсего);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеУстановитьКоличествоЦенников(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		
		Количество = 0;
		
		МассивСтрок = Элементы.Товары.ВыделенныеСтроки;
		Для Каждого НомерСтроки Из МассивСтрок Цикл
			СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
			СтрокаТЧ.Количество  = ВыбранноеЗначение;
			Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЦенникаЭтикетки) Тогда
				СтрокаТЧ.Выбран = Истина;
			КонецЕсли;
			
			Если СтрокаТЧ.Выбран Тогда
				Количество = Количество + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		КоличествоВсего = МассивСтрок.Количество();
		
		Текст = НСтр("ru = 'Установлено количество ценников %Количество%.'");
		Текст = СтрЗаменить(Текст, "%Количество%", ВыбранноеЗначение);
		
		ПоказатьОповещениеПользователюОВозможнойОшибке(Текст, Количество, КоличествоВсего);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОповещениеПользователюОВозможнойОшибке(Текст, Количество, КоличествоВсего)
	
	Если Количество < КоличествоВсего Тогда
		
		Текст = Текст
		        + ?(Текст <> "", Символы.ПС, "")
		        + НСтр("ru = 'Отметка выбора установлена для %КоличествоВыбранных% строк из %КоличествоВсего%.'");
	
		Текст = Текст
		        + Символы.ПС
		        + НСтр("ru = 'Проверьте, заполнены ли все обязательные реквизиты.'");
	
		Текст = СтрЗаменить(Текст, "%КоличествоВыбранных%", Количество);
		Текст = СтрЗаменить(Текст, "%КоличествоВсего%", КоличествоВсего);
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Операция выполнена'"), , Текст);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДанныеДляПринтераЭтикетокНаСервере(ПараметрыПечати, ПоляДляЗаполнения)
	
	ШаблоныДляПечати = ПараметрыПечати.Товары.Выгрузить(,"ШаблонЦенникаЭтикетки");
	ПоляДляЗаполнения = Обработки.ПечатьЭтикетокИЦенниковБПО.ПоляШаблонов(ШаблоныДляПечати);
	ДанныеНоменклатурыДляФормированияПечатныхФорм = ПечатьЭтикетокИЦенниковБПОПереопределяемый.ДанныеДляФормированияПечатныхФорм(ПараметрыПечати, ПоляДляЗаполнения);
	ДанныеЭтикеток = Обработки.ПечатьЭтикетокИЦенниковБПО.ДанныеДляПечатиЭтикеток(ДанныеНоменклатурыДляФормированияПечатныхФорм, ПоляДляЗаполнения);
	
	Возврат ДанныеЭтикеток;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКомандыПечатиЦенниковИЭтикетокНаПринтереЭтикетокЗавершение(РезультатПечати, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатПечати.Результат Тогда
		ПоказатьПредупреждение(, РезультатПечати.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
